/*Дано число D и указатель P1 на вершину непустого стека.
Добавить элемент со значением D в стек и вывести адрес P2 новой вершины стека.

Для каждой динамической структуры должен быть предусмотрен стандартный набор методов -
добавления/удаления/вывода элементов.
Во всех задачах обязательно наличие дружественного интерфейса. Ввод данных с клавиатуры.

В заданиях подгруппы структура «стек» (stack) моделируется цепочкой связанных
узлов-записей типа TNode. Поле Next последнего элемента цепочки равно nullptr. Вершиной
стека (top) считается первый элемент цепочки. Для доступа к стеку используется указатель на
его вершину (для пустого стека данный указатель полагается равным nullptr). Значением
элемента стека считается значение его поля Data*/

#include <iostream>
#include "Header.h"

//FIX_ME: Директива using namespace std запрещена Google Style Guide.
//using namespace std;
//Использовать полные имена std::.
//FIX_ME: Определение классов и методов написоно в загаловочном
//FIX_ME: Описание методов и функций в доп. файле cpp


int main() {

    //FIX_ME: вывод кирилицы 
    setlocale(LC_ALL, "russian");

    Stack stack;
    int choice, value;

    while (true) {
		//FIX_ME: не используется полное имя
        /*
        cout << "\nМеню:\n";
        cout << "1. Добавить элемент в стек\n";
        cout << "2. Удалить элемент из стека\n";
        cout << "3. Вывести элементы стека\n";
        cout << "4. Очистить стек\n";
        cout << "5. Выйти\n";
        cout << "Введите ваш выбор: ";
        cin >> choice;
        */
        std::cout << "\nМеню:\n";
        std::cout << "1. Добавить элемент в стек\n";
        std::cout << "2. Удалить элемент из стека\n";
        std::cout << "3. Вывести элементы стека\n";
        std::cout << "4. Очистить стек\n";
        std::cout << "5. Выйти\n";
        std::cout << "Введите ваш выбор: ";

        // FIX_ME: Не проверялось корректное чтение пункта меню.
        // cin >> choice;
        if (!(std::cin >> choice)) {
            std::cerr
                << "Ошибка. Пункт меню должен быть "
                << "целым числом.\n";

            std::cin.clear();
            std::cin.ignore(10000, '\n');

            continue;
        }
        

        switch (choice) {
        case 1:
            std::cout << "Введите число для добавления в стек: ";
            
            //FIX_ME: Не проверялось корректное чтение
            // добавляемого значения.
            // cin >> value;
            if (!(std::cin >> value)) {
                std::cerr
                    << "Ошибка. Значение должно быть "
                    << "целым числом.\n";

                std::cin.clear();
                std::cin.ignore(10000, '\n');

                break;
            }
            add_element_and_print_address(stack, value);
            break;
        case 2:
            stack.pop();
            break;
        case 3:
            stack.print();
            break;
        case 4:
            stack.clear_stack();
            break;
        case 5:
            std::cout << "Выход из программы." << '/n';
            return 0;
        default:
            std::cout << "Неверный выбор! Пожалуйста, попробуйте снова." << '/n';
        }
    }

    return 0;
}